# Quiz 2

## Question 1
 For the following code, which of the following statements will not return True?

In [49]:
import pandas as pd
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']

obj1

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [50]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

print(obj2)
print(obj3)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [51]:
print(obj3['California'])

x = obj2['California']
# obj2['California'] != obj2['California']

print(x, obj2['California'], obj2["California"] != x)

True
nan nan True

## NAN is not equal to anything, including itself

In [52]:
obj2['California'] == None

False

In [53]:
import math 

math.isnan(obj2['California'])

True

## Question 2)
In the above python code, the keys of the dictionary d represent student ranks and the value for each key is a student name. Which of the following can be used to extract rows with student ranks that are lower than or equal to 3?

In [54]:
import pandas as pd
d = {'1': 'Alice','2': 'Bob','3': 'Rita','4': 'Molly','5': 'Ryan'}
S = pd.Series(d)
S

1    Alice
2      Bob
3     Rita
4    Molly
5     Ryan
dtype: object

In [55]:
S.iloc[0:3] #iloc is used to access the index of the series

1    Alice
2      Bob
3     Rita
dtype: object

# Question 3

Suppose we have a DataFrame named df. We want to change the original DataFrame df in a way that all the column names are cast to upper case. Which of the following expressions is incorrect to perform the same?


* df.rename(mapper = lambda x: x.upper(), axis = 1)

* df.rename(mapper = lambda x: x.upper(), axis = 1, inplace = True)

* df = df.rename(mapper = lambda x: x.upper(), axis = 1)

* df = df.rename(mapper = lambda x: x.upper(), axis = 'columns')

## Question 4

For the given DataFrame df we want to keep only the records with a toefl score greater than 105. Which of the following will not work?

In [56]:
# A data frame with 3 columns. "Serial No", "Gre Score", "TOEFL Score

import pandas as pd
data = {'Serial No': [1, 2, 3, 4, 5], 'GRE Score': [337, 324, 316, 322, 314], 'TOEFL Score': [118, 107, 104, 110, 103]} #dictionary

df = pd.DataFrame(data)

df

   Serial No  GRE Score  TOEFL Score
0          1        337          118
1          2        324          107
2          3        316          104
3          4        322          110
4          5        314          103

In [57]:
df[df["TOEFL Score"] > 105]

   Serial No  GRE Score  TOEFL Score
0          1        337          118
1          2        324          107
3          4        322          110

In [58]:
# the where function alone will not work as it will keep all the rows and replace the values that do not meet the condition with NaN

df.where(df["TOEFL Score"] > 105)

   Serial No  GRE Score  TOEFL Score
0        1.0      337.0        118.0
1        2.0      324.0        107.0
2        NaN        NaN          NaN
3        4.0      322.0        110.0
4        NaN        NaN          NaN

In [59]:
# to remove the rows that do not meet the condition, we can use the dropna function

df.where(df["TOEFL Score"] > 105).dropna()

   Serial No  GRE Score  TOEFL Score
0        1.0      337.0        118.0
1        2.0      324.0        107.0
3        4.0      322.0        110.0

# Question 5

Which of the following can be used to create a DataFrame in Pandas?
1 point

* Pandas Series object

* All of these work

* 2D ndarray

* Python dict

Answer: All of these work

## Question 6

Which of the following is an incorrect way to drop entries from the Pandas DataFrame named df shown below?

In [60]:
# let's create a data frame with 4 columns. "one", "two", "three", "four" with 4 rows each for 4 states "Ohio", "Colorado", "Utah", "New York"

data = {'Ohio': [0, 1, 2, 3], 'Colorado': [4, 5, 6, 7], 'Utah': [8, 9, 10, 11], 'New York': [12, 13, 14, 15]}

df = pd.DataFrame(data, columns=["one", "two", "three", "four"], index=["Ohio", "Colorado", "Utah", "New York"])

df

          one  two three four
Ohio      NaN  NaN   NaN  NaN
Colorado  NaN  NaN   NaN  NaN
Utah      NaN  NaN   NaN  NaN
New York  NaN  NaN   NaN  NaN

In [61]:
df = pd.DataFrame(data)
df = df.T # .T doesn't work in place, so you need to assign it back to the variable

df

           0   1   2   3
Ohio       0   1   2   3
Colorado   4   5   6   7
Utah       8   9  10  11
New York  12  13  14  15

In [62]:
# let's rename the columns of the data frame
#since the index is being changed for reasons unknown, we will store the index

df.columns = ["one", "two", "three", "four"]
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [63]:
# another way to create the same data frame is using an different dictionary

data2 = { 'one': [0, 4, 8, 12], 'two': [1, 5, 9, 13], 'three': [2, 6, 10, 14], 'four': [3, 7, 11, 15]}

df2 = pd.DataFrame(data2, index=["Ohio", "Colorado", "Utah", "New York"])

df2

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [70]:
# Let's now answer the question.

df.drop(["Utah", "Colorado"]) #axis = 0 is the default value

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [67]:
df.drop("one", axis=1) #axis = 1 is used to drop columns

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [72]:
# df.drop("two") is the wrong way

df.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [73]:
df.drop("Ohio") #axis = 0 is the default value

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## Question 7

For the Series s1 and s2 defined below, which of the following statements will give an error?

In [75]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [76]:
s2.loc[1] #this will throw an error. There is no index 1 in s2

KeyError: 1

In [80]:
s2[1] #same as s2.loc["Jack"] or s2.iloc[1]

2

In [81]:
s2.loc["Jack"]

2

In [83]:
s2.iloc[1]

2

In [82]:
s1.loc[1]

'Alice'


## Question 8

Which of the following statements is incorrect?
1 point

* If s is a pd.Series object, then we can use s.loc[label] to get all data where the index is equal to label.

* If s and s1 are two pd.Series objects, we cannot use s.append(s1) to directly append s1 to the existing series s (CHOSEN ANSWER)

* We can use s.iteritems() on a pd.Series object s to iterate on it.

* loc and iloc are two useful and commonly used Pandas methods.

## Question 9

For the given DataFrame df shown above, we want to get all records with a toefl score greater than 105 but smaller than 115. Which of the following expressions is incorrect to perform the same?

In [94]:
import pandas as pd
data = {'Serial No': [1, 2, 3, 4, 5], 'GRE Score': [337, 324, 316, 322, 314], 'TOEFL Score': [118, 107, 104, 110, 103]} #dictionary

df = pd.DataFrame(data)

df = df.set_index("Serial No")

# all columns in lowercase

df.columns = df.columns.str.lower()

df

           gre score  toefl score
Serial No
1                337          118
2                324          107
3                316          104
4                322          110
5                314          103

In [95]:
df[(df['toefl score'] > 105) & (df['toefl score'] < 115)]

           gre score  toefl score
Serial No
2                324          107
4                322          110

In [96]:
(df['toefl score'] > 105) & (df['toefl score'] < 115) Â°#it's like a boolean masking

Serial No
1    False
2     True
3    False
4     True
5    False
Name: toefl score, dtype: bool

In [99]:
df[df['toefl score'].isin(range(106, 115))]

           gre score  toefl score
Serial No
2                324          107
4                322          110

In [100]:
df[df['toefl score'].gt(105) & df['toefl score'].lt(115)]

           gre score  toefl score
Serial No
2                324          107
4                322          110

## Question 10

Which of the following is the correct way to extract all information related to the student named Alice from the DataFrame df given below:

In [102]:
# let's create the dataframe

data = {"Major": ["Mathematics", "Sociology"], "Name": ["Alice", "Jack"], "Age": [20, 22], "Gender": ["F", "M"]}

df = pd.DataFrame(data).set_index("Major")

df

              Name  Age Gender
Major
Mathematics  Alice   20      F
Sociology     Jack   22      M

In [107]:
df.iloc['Mathematics']

TypeError: Cannot index by location index with a non-integer key

In [108]:
df.T['Mathematics']

Name      Alice
Age          20
Gender        F
Name: Mathematics, dtype: object

In [109]:
df["Name"]

Major
Mathematics    Alice
Sociology       Jack
Name: Name, dtype: object